{
  "backend/main.mo": "Motoko canister managing user profiles and audio mastering projects with strict access control and CRUD operations for projects.",
  "feature_evidence.json": "Feature evidence report listing PWA install visibility and i18n updates along with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files across styling, components, hooks, audio engine, and i18n modules.",
  "frontend/index.css": "Tailwind base layer defining root color tokens, dark mode variants, and global background/foreground styling.",
  "frontend/index.html": "Basic HTML entry point setting up the root div and loading the main React script.",
  "frontend/src/App.tsx": "Main React app with routing, layout, theming, i18n, authentication UI, PWA entry point, and page registration.",
  "frontend/src/audio/engine.ts": "Web Audio mastering engine implementing EQ, saturation, compression, limiter, stereo width, and reference-track processing.",
  "frontend/src/audio/metadata.ts": "Utility for validating audio file type/size and extracting metadata via AudioContext decoding.",
  "frontend/src/audio/presets.ts": "Defines the MasteringPreset interface and provides a collection of audio mastering presets with EQ, compression, limiter, saturation, stereo width, and gain settings.",
  "frontend/src/audio/wavExport.ts": "Exports processed audio to WAV by building an offline mastering chain using the selected preset and returning the rendered audio as a Blob.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout flow and displays an auth button with status-based UI.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter a profile name and saves it via API hooks.",
  "frontend/src/components/HelpFAQ.tsx": "Displays a localized FAQ section with questions and answers using the app’s i18n system.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Provides a dropdown menu to switch between supported languages using the i18n system.",
  "frontend/src/components/projects/ProjectsPanel.tsx": "Lists user projects with preset names, timestamps, and delete actions, handling localization and API integration.",
  "frontend/src/components/PwaInstallEntryPoint.tsx": "Shows a button to trigger PWA installation when supported, with localized labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, logout, and status flags. Includes helper functions to create an AuthClient and restore stored identities.",
  "frontend/src/hooks/useProjects.ts": "Defines React Query hooks to fetch, create, and delete mastering projects via an actor API, with automatic cache invalidation. Handles error propagation and actor availability checks.",
  "frontend/src/hooks/usePwaInstallVisibility.ts": "Tracks PWA install availability, installation state, and triggers the browser install prompt. Detects standalone installation and reacts to install events.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to load and save the caller's user profile through an actor API, integrating with React Query. Manages loading state and cache invalidation.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context storing the current language and translations, persisting the language in localStorage. Provides a hook for accessing the translation context.",
  "frontend/src/i18n/presets.ts": "Defines localized preset names and descriptions for each supported language. Maps preset keys to translation objects.",
  "frontend/src/i18n/translations.ts": "Contains full translation dictionaries for English and Portuguese covering UI strings. Also defines types for language and translation structures.",
  "frontend/src/i18n/useI18n.ts": "Exports a simple hook that returns the i18n context for accessing translations and language control.",
  "frontend/src/index.css": "Sets global Tailwind layers and design tokens, defining color variables and themes for light and dark modes. Includes custom utility styles like waveform gradients and glass effects.",
  "frontend/src/main.tsx": "Bootstraps the React application with QueryClientProvider and InternetIdentityProvider. Renders the root App component and imports global CSS.",
  "frontend/src/pages/Landing.tsx": "Implements the landing page with hero and workflow sections, localized text, and navigation logic based on authentication. Displays marketing content and a CTA to start using the app.",
  "frontend/src/pages/MasteringStudio.tsx": "Main studio page handling audio upload, metadata extraction, mastering engine setup, reference track loading, playback modes, and export flow.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters and sessionStorage values, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining typography, container settings, theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata and roadmap containing versioning, architectural notes, existing features, and known issues for the mastering platform."
}