{
  "backend/main.mo": "Main backend canister implementing authorization, user profiles, mastering project management, and blob storage integration.",
  "backend/migration.mo": "Migration module converting old project records to the new format by adding nullable blob fields.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs for deployment and smoke‑test verification.",
  "frontend-file-summaries.txt": "List of prewritten summaries for many frontend files covering styles, pages, hooks, audio engine logic, and i18n.",
  "frontend/DEPLOYMENT_PRODUCTION.md": "Guide describing prerequisites and steps to deploy the frontend to production.",
  "frontend/index.css": "Base Tailwind stylesheet defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML shell that loads the React application entrypoint.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Post‑deployment smoke test checklist validating core app functionality including auth, upload, presets, and playback.",
  "frontend/src/App.tsx": "Top-level React app configuring routing, theming, i18n, header/footer layout, authentication UI, and studio navigation.",
  "frontend/src/audio/engine.ts": "Implements a Web Audio–based mastering engine with EQ, saturation, compression, limiting, stereo width, and reference/compare routing.",
  "frontend/src/audio/metadata.ts": "Provides audio file validation and metadata extraction using the Web Audio API.",
  "frontend/src/audio/presets.ts": "Defines the MasteringPreset interface and a collection of built‑in mastering presets with EQ, compression, limiter, saturation, and stereo width settings.",
  "frontend/src/audio/wavExport.ts": "Renders mastered audio to a WAV Blob using an OfflineAudioContext and preset‑based processing chain.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter and save a display name.",
  "frontend/src/components/HelpFAQ.tsx": "Renders a localized FAQ section with questions and answers.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Provides a dropdown UI for switching application languages.",
  "frontend/src/components/projects/ProjectsPanel.tsx": "Renders a list of projects with delete actions, date formatting, and preset name localization. Uses i18n, project hooks, and shows loading/empty states.",
  "frontend/src/components/PwaInstallEntryPoint.tsx": "Displays a PWA install button when installation is available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes. Loads secret admin token and initializes access control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and persists identity via AuthClient. Exposes context with status flags and identity management hooks.",
  "frontend/src/hooks/useProjects.ts": "Supplies React Query hooks to fetch, create, and delete mastering projects using the backend actor. Automatically invalidates the projects query on mutations.",
  "frontend/src/hooks/usePwaInstallVisibility.ts": "Tracks PWA install eligibility and state, handling beforeinstallprompt events and triggering installation prompts. Stores installation status in localStorage.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller's user profile through the backend actor using React Query. Invalidates the profile query on updates and handles loading state with actor readiness.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, locale, and translations with persistence in localStorage. Wraps children with an i18n context for accessing t and language setters.",
  "frontend/src/i18n/presets.ts": "Defines localized names and descriptions for mastering presets in Portuguese and English. Exports a lookup used to display preset metadata.",
  "frontend/src/i18n/translations.ts": "Defines the full translation schema and language-specific text for UI sections in Portuguese and English. Exports the translations mapping keyed by language.",
  "frontend/src/i18n/useI18n.ts": "Convenience hook that returns the i18n context exposed by I18nProvider.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark OKLCH color variables plus utility classes like waveform-gradient and glass-effect.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider and loads global styles.",
  "frontend/src/pages/Landing.tsx": "Implements the public landing page with hero, workflow sections, and authentication-aware Get Started button.",
  "frontend/src/pages/MasteringStudio.tsx": "Implements the authenticated mastering UI, handling audio loading, metadata, presets, playback, exporting, and project CRUD.",
  "frontend/src/utils/audioErrors.ts": "Provides normalized error messages and dev-mode logging helpers for audio-related errors.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and OKLCH-driven theme tokens.",
  "project_state.json": "Metadata describing the project state, approved version, features, and deployment context."
}