{
  "backend/main.mo": "Motoko canister providing access-controlled user profiles and mastering project management with create, update, and query operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented i18n and localization features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their purpose, UI behavior, and i18n integration.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH theme variables for light and dark modes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entry point loading the main React bundle into the root element.",
  "frontend/src/App.tsx": "Main React app wiring theme, i18n, routing, layout, header language switcher, and authentication-driven studio navigation.",
  "frontend/src/audio/engine.ts": "Web Audio mastering engine implementing EQ, saturation, compression, limiting, stereo width, and reference track processing.",
  "frontend/src/audio/metadata.ts": "Defines audio metadata and validates audio files, then extracts duration and format details using AudioContext.",
  "frontend/src/audio/presets.ts": "Defines mastering preset interface and a set of EQ, compression, saturation, stereo width, and gain presets.",
  "frontend/src/audio/wavExport.ts": "Renders processed audio to a WAV blob using an OfflineAudioContext and a full mastering chain based on a preset.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to set a display name and saves it via mutation.",
  "frontend/src/components/HelpFAQ.tsx": "Displays a localized FAQ section with questions and answers.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Dropdown UI to switch application language between Portuguese and English.",
  "frontend/src/components/projects/ProjectsPanel.tsx": "Lists user projects with preset info, timestamps, and deletion support, using localized text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, including login, logout, and identity state handling.",
  "frontend/src/hooks/useProjects.ts": "Defines React Query hooks to fetch, create, and delete mastering projects via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Implements hooks to fetch and update the caller's user profile using React Query and the backend actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides an i18n context with language state, translations, and persistence via localStorage.",
  "frontend/src/i18n/presets.ts": "Contains localized names and descriptions for mastering presets in English and Portuguese.",
  "frontend/src/i18n/translations.ts": "Defines the full translation schema and strings for all UI text in English and Portuguese.",
  "frontend/src/i18n/useI18n.ts": "Exports a hook that returns the current i18n context values.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and utility classes for the UI.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in Internet Identity and React Query providers.",
  "frontend/src/pages/Landing.tsx": "Implements the landing page UI with hero content, workflow steps, and login-or-navigate behavior.",
  "frontend/src/pages/MasteringStudio.tsx": "Main mastering UI handling audio uploads, metadata extraction, preset selection, playback modes, reference tracks, exporting, and project creation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings with custom plugins.",
  "project_state.json": "Project state metadata describing features, architecture notes, and versioned requirements for the mastering platform."
}