{
  "backend/main.mo": "Motoko canister managing user profiles and mastering projects with access control, including create, update, and query operations.",
  "feature_evidence.json": "Machine-generated report mapping feature fixes to affected frontend audio files and associated components/tests.",
  "frontend-file-summaries.txt": "A list of prewritten summaries describing each frontend file’s purpose, focusing on audio processing, UI, and i18n.",
  "frontend/index.css": "Tailwind base layer defining light/dark OKLCH color tokens and global background/foreground styles.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React app wiring routing, theming, i18n, authentication UI, layout, and global providers.",
  "frontend/src/audio/engine.ts": "Web Audio mastering engine implementing EQ, saturation, compression, stereo width routing, and reference‑mode processing.",
  "frontend/src/audio/metadata.ts": "Validates uploaded audio files and extracts duration, sample rate, and channel count using Web Audio API.",
  "frontend/src/audio/presets.ts": "Defines the MasteringPreset interface and provides several mastering preset configurations with EQ, compression, limiter, saturation, stereo width, and gain settings.",
  "frontend/src/audio/wavExport.ts": "Renders audio to WAV using an offline audio context, applying EQ, saturation, compression, limiting, stereo width, and output gain based on a preset.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to set a display name and saves it via profile hooks.",
  "frontend/src/components/HelpFAQ.tsx": "Displays a help and FAQ section using i18n data with a list of questions and answers.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Dropdown menu allowing users to switch between supported languages using the i18n system.",
  "frontend/src/components/projects/ProjectsPanel.tsx": "Lists user projects with preset info, creation date, and delete actions, using project-related hooks and i18n.",
  "frontend/src/components/PwaInstallEntryPoint.tsx": "Shows a button to trigger PWA installation when supported, using state from a custom visibility hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status flags.",
  "frontend/src/hooks/useProjects.ts": "Defines React Query hooks to fetch, create, and delete mastering projects through the backend actor.",
  "frontend/src/hooks/usePwaInstallVisibility.ts": "Tracks PWA installation state and exposes a method to trigger the install prompt.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the current user's profile using React Query and the backend actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n provider storing language in localStorage and exposing translations via context.",
  "frontend/src/i18n/presets.ts": "Contains localized names and descriptions for mastering presets in Portuguese and English.",
  "frontend/src/i18n/translations.ts": "Defines full localization strings for the app in Portuguese and English.",
  "frontend/src/i18n/useI18n.ts": "Exports a simple hook to access the i18n context.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and theme variables for light and dark modes with custom styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/Landing.tsx": "Renders the landing page with hero, workflow sections, translations, and authentication-based navigation.",
  "frontend/src/pages/MasteringStudio.tsx": "Main React page for the audio mastering UI, handling file loading, playback modes, presets, reference tracks, and project creation. Manages MasteringEngine lifecycle, validation, metadata extraction, and user interactions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading and writing URL parameters and persisting them in sessionStorage. Supports both query-string and hash-based routing and allows clearing parameters from the URL.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, animations, and container settings. Includes typography, container-queries, and animation plugins.",
  "project_state.json": "JSON describing the project’s state, including known issues and required fixes related to audio playback and WAV export for mono and stereo files."
}