{
  "kind": "build_request",
  "title": "Hide the PWA install/download button after the app is installed",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Update the existing PWA install/download entry point so it automatically hides once the app is installed (and stays hidden on subsequent visits when already installed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Adicione um botao de baixar o app que some depois de baixar"
        ]
      },
      "acceptanceCriteria": [
        "When the PWA is already installed (e.g., the app is running in standalone display-mode), the install/download button is not rendered anywhere it normally appears.",
        "When the user successfully completes installation (browser fires the appinstalled event), the install/download button disappears immediately without requiring a page refresh.",
        "If the user dismisses the install prompt or installation is not available, the install/download entry point remains visible and usable (no premature hiding).",
        "The hidden/visible state is correct after a full reload (no flicker of the button when already installed)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add/extend i18n strings for the install/download entry point (label + any short helper text it uses) so the new/updated UI text is localized for both Portuguese (pt-BR) and English (en). Use English copy for the en locale (e.g., \"Install app\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Adicione um botao de baixar o app que some depois de baixar"
        ]
      },
      "acceptanceCriteria": [
        "All user-visible text introduced or changed for the install/download entry point is sourced from the i18n dictionary (not hard-coded).",
        "Both 'pt-BR' and 'en' locales have translations for the install/download entry point strings.",
        "In the en locale, the primary action label is in English (e.g., \"Install app\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui; compose existing UI components instead.",
    "Frontend changes must remain compatible with the existing PWA support and existing install/download entry point feature (do not remove install capability)."
  ],
  "nonGoals": [
    "Adding new backend endpoints or storing installation state in the backend.",
    "Changing the mastering/audio processing behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}