{
  "kind": "build_request",
  "title": "Promote App Draft Version 9 to Production",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Promote the current approved draft (App draft Version 9) to production by deploying both the frontend and the backend canister(s) to the production environment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "🎬 App draft Version 9 is ready for review",
          "Want me to push this version to production next?",
          "Sim"
        ]
      },
      "acceptanceCriteria": [
        "Production environment is updated to App draft Version 9 for both frontend and backend canisters.",
        "No deployment errors occur; deployment completes successfully.",
        "The production URL serves the updated frontend bundle."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Run a production smoke test after deployment to verify core flows: load landing page, authenticate with Internet Identity, navigate to Mastering Studio, upload an audio file, apply a preset, export WAV, and verify projects list loads/updates.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Got it — starting the build now."
        ]
      },
      "acceptanceCriteria": [
        "Landing page loads without console errors.",
        "Internet Identity login/logout succeeds.",
        "Authenticated user can reach /studio route and the UI renders.",
        "Audio upload + preset application completes without runtime errors.",
        "WAV export completes and downloads.",
        "Projects panel loads and reflects newly created project entries (if applicable)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text in this build request.",
    "Do not modify files under the frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing new audio presets beyond what is already included in App draft Version 9.",
    "Changing UI design, translations, or audio processing logic as part of this production push."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}