{
  "kind": "build_request",
  "title": "Fix runtime error when pressing Play in Mastering Studio",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Play runtime error in Mastering Studio by making the audio playback chain compatible with both mono and stereo source files (e.g., do not create/use a 2-channel stereo-width splitter/merger path when the loaded audio buffer has 1 channel).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Meu App esta dando erro de execução de play, resolva esse erro"
        ]
      },
      "acceptanceCriteria": [
        "With a mono (1-channel) audio file loaded, pressing Play in any available mode (Original and Mastered; Reference if provided) does not throw a runtime exception and audio plays as expected.",
        "With a stereo (2-channel) audio file loaded, pressing Play continues to work and stereo-width processing (when enabled by preset) still functions without runtime errors.",
        "If a mono file is loaded and stereo-width processing is not applicable, the app safely bypasses stereo-width nodes rather than crashing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix WAV export rendering so it does not throw runtime errors for mono source files by making the offline mastering chain compatible with the source buffer channel count (avoid forcing a 2-channel splitter/merger when rendering 1-channel audio).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Meu App esta dando erro de execução de play, resolva esse erro"
        ]
      },
      "acceptanceCriteria": [
        "Exporting a mastered WAV from a mono source file completes successfully and downloads a valid WAV file.",
        "Exporting a mastered WAV from a stereo source file continues to work as before.",
        "No console runtime errors occur during export for either mono or stereo files."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Keep all backend logic in the single Motoko actor (no backend changes are required for this fix unless strictly necessary)."
  ],
  "nonGoals": [
    "Adding new mastering features or new presets.",
    "Changing authentication, project CRUD, or PWA behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}