{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Promote App Draft Version 9 to Production (Frontend-only plan)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Promote App draft Version 9 to production by deploying the frontend bundle (frontend-side release guidance only in this plan).",
      "acceptanceCriteria": [
        "Production environment is updated to App draft Version 9 for both frontend and backend canisters.",
        "No deployment errors occur; deployment completes successfully.",
        "The production URL serves the updated frontend bundle."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_PRODUCTION.md",
          "operation": "create",
          "description": "Add an English, frontend-focused production deployment runbook for promoting the approved draft to production (build, verify generated assets, and release checklist). Ensure it notes that backend deployment is required but out of scope for this frontend-only plan. Also include a reminder not to modify frontend immutable paths. (No component usage.)"
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Run a post-deploy production smoke test for core user flows (landing, Internet Identity auth, studio navigation, upload, preset, export WAV, projects list update).",
      "acceptanceCriteria": [
        "Landing page loads without console errors.",
        "Internet Identity login/logout succeeds.",
        "Authenticated user can reach /studio route and the UI renders.",
        "Audio upload + preset application completes without runtime errors.",
        "WAV export completes and downloads.",
        "Projects panel loads and reflects newly created project entries (if applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_SMOKE_TEST.md",
          "operation": "create",
          "description": "Create an English step-by-step smoke test checklist aligned to the acceptance criteria, referencing the existing UI routes/pages (/, /studio) and the existing flows (LoginButton + Internet Identity, MasteringStudio upload/preset/export, ProjectsPanel list refresh). Include expected results, what to capture on failure (console logs/network errors), and a short rollback/escalation note. (No component usage.)"
        },
        {
          "path": "frontend/src/pages/MasteringStudio.tsx",
          "operation": "modify",
          "description": "Add non-invasive, production-safe console error guards (e.g., ensure async errors in upload/preset/export paths are surfaced via existing toast/error handling rather than unhandled promise rejections) to improve smoke-test reliability without changing audio processing logic or UI design. Keep all user-facing text in English and reuse existing i18n/toast strings. (No component usage.)"
        }
      ]
    }
  ]
}