{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mastering Studio mono/stereo-safe playback and WAV export",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the realtime Web Audio playback chain mono/stereo compatible by conditionally bypassing stereo-width routing for mono buffers.",
      "acceptanceCriteria": [
        "With a mono (1-channel) audio file loaded, pressing Play in any available mode (Original and Mastered; Reference if provided) does not throw a runtime exception and audio plays as expected.",
        "With a stereo (2-channel) audio file loaded, pressing Play continues to work and stereo-width processing (when enabled by preset) still functions without runtime errors.",
        "If a mono file is loaded and stereo-width processing is not applicable, the app safely bypasses stereo-width nodes rather than crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/audio/engine.ts",
          "operation": "modify",
          "description": "Refactor the mastered playback routing so stereo-width (ChannelSplitter/ChannelMerger M/S path) is only connected when the loaded source buffer has 2 channels and the current preset enables stereo width; otherwise, route limiter directly to output gain to safely bypass stereo-width nodes for mono sources. Ensure connections are reconfigured safely (disconnect/reconnect) when preset changes or new audio is loaded so Play never throws due to invalid channel indexing."
        },
        {
          "path": "frontend/src/pages/MasteringStudio.tsx",
          "operation": "modify",
          "description": "Add lightweight defensive handling around playback start to ensure the engine’s current routing reflects the loaded buffer’s channel count before starting mastered playback (e.g., trigger a re-apply of the selected preset or a routing refresh after load) so mono/stereo switching cannot leave the engine in an incompatible state."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make offline WAV export rendering mono/stereo compatible by building an offline mastering chain that only uses stereo-width splitter/merger when the source buffer is stereo.",
      "acceptanceCriteria": [
        "Exporting a mastered WAV from a mono source file completes successfully and downloads a valid WAV file.",
        "Exporting a mastered WAV from a stereo source file continues to work as before.",
        "No console runtime errors occur during export for either mono or stereo files."
      ],
      "file_operations": [
        {
          "path": "frontend/src/audio/wavExport.ts",
          "operation": "modify",
          "description": "Update the offline mastering chain construction to be channel-count aware: when rendering mono (1-channel), bypass stereo-width processing entirely by connecting limiter directly to output gain (and then destination), and only create/connect the 2-channel splitter/merger stereo-width path when the source buffer has 2 channels and the preset enables stereo width."
        }
      ]
    }
  ]
}