{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-hide PWA install button once installed + i18n",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Ensure the PWA install/download entry point hides automatically after installation and remains hidden on subsequent visits when already installed.",
      "acceptanceCriteria": [
        "When the PWA is already installed (e.g., the app is running in standalone display-mode), the install/download button is not rendered anywhere it normally appears.",
        "When the user successfully completes installation (browser fires the appinstalled event), the install/download button disappears immediately without requiring a page refresh.",
        "If the user dismisses the install prompt or installation is not available, the install/download entry point remains visible and usable (no premature hiding).",
        "The hidden/visible state is correct after a full reload (no flicker of the button when already installed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePwaInstallVisibility.ts",
          "operation": "create",
          "description": "Create a hook that determines whether the app is already installed (e.g., display-mode standalone / iOS standalone) and tracks installation completion via the window appinstalled event; persist an installed flag locally to ensure correct state after reload with no flicker."
        },
        {
          "path": "frontend/src/components/PwaInstallEntryPoint.tsx",
          "operation": "create",
          "description": "Create/extend the PWA install/download entry point UI to render only when installation is available AND the app is not installed, using the usePwaInstallVisibility hook; ensure it does not hide on prompt dismissal/unavailability and hides immediately when appinstalled fires. Compose existing UI components from frontend/src/components/ui (do not modify them)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the updated PwaInstallEntryPoint into the existing layout where the install/download entry point normally appears (e.g., header action area), ensuring it is not rendered when already installed and is removed immediately after installation."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Localize the install/download entry point label and helper text for pt-BR and en via the existing i18n dictionaries.",
      "acceptanceCriteria": [
        "All user-visible text introduced or changed for the install/download entry point is sourced from the i18n dictionary (not hard-coded).",
        "Both 'pt-BR' and 'en' locales have translations for the install/download entry point strings.",
        "In the en locale, the primary action label is in English (e.g., \"Install app\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add/extend translation keys for the PWA install/download entry point (at minimum: label and any short helper text) in both 'pt-BR' and 'en' dictionaries, and update the Translations type accordingly."
        },
        {
          "path": "frontend/src/components/PwaInstallEntryPoint.tsx",
          "operation": "modify",
          "description": "Update the install/download entry point to source its label and any helper text from the i18n hook (useI18n) and the new translations keys (no hard-coded strings)."
        }
      ]
    }
  ]
}